pok3r-custom/pok3r_re_firmware/doc/HT32F1655_56_FWLib_v102_960/library/HT32F1655_56_Driver/inc/ht32f1655_56_gptm.h
/*********************************************************************************************************//**
 * @file    ht32f1655_56_gptm.h
 * @version $Rev:: 921          $
 * @date    $Date:: 2015-09-16 #$
 * @brief   The header file of the GPTM library.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) 2014 Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------------------------------------*/
#ifndef __HT32F1655_56_GPTM_H
#define __HT32F1655_56_GPTM_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32f1655_56.h"

/** @addtogroup HT32F1655_56_Peripheral_Driver HT32F1655/1656 Peripheral Driver
  * @{
  */

/** @addtogroup GPTM
  * @{
  */


/* Exported types ------------------------------------------------------------------------------------------*/
/** @defgroup GPTM_Exported_Types GPTM exported types
  * @{
  */
/**
 * @brief  Enumeration of GPTM counter mode.
 */
typedef enum
{
  GPTM_CNT_MODE_UP   = 0x00000000,  /*!< Edge up-counting mode                                              */
  GPTM_CNT_MODE_CA1  = 0x00010000,  /*!< Center-align mode 1                                                */
  GPTM_CNT_MODE_CA2  = 0x00020000,  /*!< Center-align mode 2                                                */
  GPTM_CNT_MODE_CA3  = 0x00030000,  /*!< Center-align mode 3                                                */
  GPTM_CNT_MODE_DOWN = 0x01000000   /*!< Edge down-counting mode                                            */
} GPTM_CNT_MODE_Enum;
/**
 * @brief Enumeration of  GPTM prescaler reload time.
 */
typedef enum
{
  GPTM_PSC_RLD_UPDATE    = 0x0000,  /*!< Reload prescaler at next update event                              */
  GPTM_PSC_RLD_IMMEDIATE = 0x0100   /*!< Reload prescaler immediately                                       */
} GPTM_PSC_RLD_Enum;
/**
 * @brief Enumeration of GPTM channel.
 */
typedef enum
{
  GPTM_CH_0 = 0,                    /*!< GPTM channel 0                                                     */
  GPTM_CH_1,                        /*!< GPTM channel 1                                                     */
  GPTM_CH_2,                        /*!< GPTM channel 2                                                     */
  GPTM_CH_3                         /*!< GPTM channel 3                                                     */
} GPTM_CH_Enum;
/**
 * @brief Enumeration of GPTM channel output mode.
 */
typedef enum
{
  GPTM_OM_MATCH_NOCHANGE  = 0x0000, /*!< GPTM channel output no change on match                             */
  GPTM_OM_MATCH_INACTIVE  = 0x0001, /*!< GPTM channel output inactive level on match                        */
  GPTM_OM_MATCH_ACTIVE    = 0x0002, /*!< GPTM channel output active level on match                          */
  GPTM_OM_MATCH_TOGGLE    = 0x0003, /*!< GPTM channel output toggle on match                                */
  GPTM_OM_FORCED_INACTIVE = 0x0004, /*!< GPTM channel output forced inactive level                          */
  GPTM_OM_FORCED_ACTIVE   = 0x0005, /*!< GPTM channel output forced active level                            */
  GPTM_OM_PWM1            = 0x0006, /*!< GPTM channel pwm1 output mode                                      */
  GPTM_OM_PWM2            = 0x0007, /*!< GPTM channel pwm2 output mode                                      */
  GPTM_OM_ASYMMETRIC_PWM1 = 0x0106, /*!< GPTM channel asymmetric pwm1 output mode                           */
  GPTM_OM_ASYMMETRIC_PWM2 = 0x0107  /*!< GPTM channel asymmetric pwm2 output mode                           */
} GPTM_OM_Enum;
/**
 * @brief Enumeration of GPTM channel control.
 */
typedef enum
{
  GPTM_CHCTL_DISABLE = 0,           /*!< GPTM channel disable                                               */
  GPTM_CHCTL_ENABLE                 /*!< GPTM channel enable                                                */
} GPTM_CHCTL_Enum;
/**
 * @brief Enumeration of GPTM channel polarity.
 */
typedef enum
{
  GPTM_CHP_NONINVERTED = 0,         /*!< GPTM channel polarity is active high or rising edge                */
  GPTM_CHP_INVERTED                 /*!< GPTM channel polarity is active low or falling edge                */
} GPTM_CHP_Enum;
/**
 * @brief Enumeration of GPTM channel capture source selection.
 */
typedef enum
{
  GPTM_CHCCS_DIRECT   = 0x00010000,  /*!< GPTM channel capture selection direct input                       */
  GPTM_CHCCS_INDIRECT = 0x00020000,  /*!< GPTM channel capture selection indirect input                     */
  GPTM_CHCCS_TRCED    = 0x00030000   /*!< GPTM channel capture selection TRCED of trigger control block     */
} GPTM_CHCCS_Enum;
/**
 * @brief Enumeration of GPTM channel capture prescaler.
 */
typedef enum
{
  GPTM_CHPSC_OFF = 0x00000000,     /*!< GPTM channel capture no prescaler, capture is done each event       */
  GPTM_CHPSC_2   = 0x00040000,     /*!< GPTM channel capture is done once every 2 event                     */
  GPTM_CHPSC_4   = 0x00080000,     /*!< GPTM channel capture is done once every 4 event                     */
  GPTM_CHPSC_8   = 0x000C0000      /*!< GPTM channel capture is done once every 8 event                     */
} GPTM_CHPSC_Enum;
/**
 * @brief Enumeration of GPTM fDTS clock divider.
 */
typedef enum
{
  GPTM_CKDIV_OFF = 0x0000,          /*!< fDTS = fCLKIN                                                      */
  GPTM_CKDIV_2   = 0x0100,          /*!< fDTS = fCLKIN / 2                                                  */
  GPTM_CKDIV_4   = 0x0200           /*!< fDTS = fCLKIN / 4                                                  */
} GPTM_CKDIV_Enum;
/**
 * @brief Enumeration of GPTM ETI input prescaler.
 */
typedef enum
{
  GPTM_ETIPSC_OFF = 0x00000000,     /*!< ETI prescaler off                                                  */
  GPTM_ETIPSC_2   = 0x00001000,     /*!< ETIP frequency divided by 2                                        */
  GPTM_ETIPSC_4   = 0x00002000,     /*!< ETIP frequency divided by 4                                        */
  GPTM_ETIPSC_8   = 0x00003000      /*!< ETIP frequency divided by 8                                        */
} GPTM_ETIPSC_Enum;
/**
 * @brief Enumeration of GPTM ETI input polarity.
 */
typedef enum
{
  GPTM_ETIPOL_NONINVERTED = 0x00000000, /*!< GPTM ETI polarity is active high or rising edge                */
  GPTM_ETIPOL_INVERTED    = 0x00010000  /*!< GPTM ETI polarity is active low or falling edge                */
} GPTM_ETIPOL_Enum;
/**
 * @brief Enumeration of GPTM slave trigger input selection.
 */
typedef enum
{
  GPTM_TRSEL_UEVG   = 0x0,         /*!< Software trigger by setting UEVG bit                                */
  GPTM_TRSEL_TI0S0  = 0x1,         /*!< Filtered channel 0 input                                            */
  GPTM_TRSEL_TI1S1  = 0x2,         /*!< Filtered channel 1 input                                            */
  GPTM_TRSEL_ETIF   = 0x3,         /*!< External Trigger input                                              */
  GPTM_TRSEL_TI0BED = 0x8,         /*!< Trigger input 0 both edge detector                                  */
  GPTM_TRSEL_ITI0   = 0x9,         /*!< Internal trigger 0                                                  */
  GPTM_TRSEL_ITI1   = 0xA,         /*!< Internal trigger 1                                                  */
  GPTM_TRSEL_ITI2   = 0xB          /*!< Internal trigger 2                                                  */
} GPTM_TRSEL_Enum;
/**
 * @brief Enumeration of GPTM slave mode selection.
 */
typedef enum
{
  GPTM_SMSEL_DISABLE  = 0x0000,     /*!< The prescaler is clocked directly by the internal clock            */
  GPTM_SMSEL_DECODER1 = 0x0100,     /*!< Counter counts up/down on CH0 edge depending on CH1 level          */
  GPTM_SMSEL_DECODER2 = 0x0200,     /*!< Counter counts up/down on CH1 edge depending on CH0 level          */
  GPTM_SMSEL_DECODER3 = 0x0300,     /*!< Counter counts up/down on both CH0 & CH1 edges depending on the
                                       level of the other input */
  GPTM_SMSEL_RESTART  = 0x0400,     /*!< Slave restart mode                                                 */
  GPTM_SMSEL_PAUSE    = 0x0500,     /*!< Slave pause mode                                                   */
  GPTM_SMSEL_TRIGGER  = 0x0600,     /*!< Slave trigger mode                                                 */
  GPTM_SMSEL_STIED    = 0x0700      /*!< Rising edge of the selected trigger(STI) clock the counter         */
} GPTM_SMSEL_Enum;
/**
 * @brief  Enumeration of GPTM master mode selection.
 */
typedef enum
{
  GPTM_MMSEL_RESET   = 0x00000000,  /*!< Send trigger signal when S/W setting UEVG or slave restart         */
  GPTM_MMSEL_ENABLE  = 0x00010000,  /*!< The counter enable signal is used as trigger output.               */
  GPTM_MMSEL_UPDATE  = 0x00020000,  /*!< The update event is used as trigger output.                        */
  GPTM_MMSEL_CH0CC   = 0x00030000,  /*!< Channel 0 capture or compare match occurred as trigger output.     */
  GPTM_MMSEL_CH0OREF = 0x00040000,  /*!< The CH0OREF signal is used as trigger output.                      */
  GPTM_MMSEL_CH1OREF = 0x00050000,  /*!< The CH1OREF signal is used as trigger output.                      */
  GPTM_MMSEL_CH2OREF = 0x00060000,  /*!< The CH2OREF signal is used as trigger output.                      */
  GPTM_MMSEL_CH3OREF = 0x00070000   /*!< The CH3OREF signal is used as trigger output.                      */
} GPTM_MMSEL_Enum;
/**
 * @brief Enumeration of GPTM channel Capture / Compare PDMA selection.
 */
typedef enum
{
  GPTM_CHCCDS_CHCCEV = 0,       /*!< Send CHx PDMA request when channel capture/compare event occurs        */
  GPTM_CHCCDS_UEV               /*!< Send CHx PDMA request when update event occurs                         */
} GPTM_CHCCDS_Enum;
/**
 * @brief Definition of GPTM timebase init structure.
 */
typedef struct
{
  u16                CounterReload; /*!< Period (Value for CRR register)                                    */
  u16                Prescaler;     /*!< Prescaler (Value for PSCR register)                                */
  GPTM_CNT_MODE_Enum CounterMode;   /*!< Counter mode refer to \ref GPTM_CNT_MODE_Enum                      */
  GPTM_PSC_RLD_Enum  PSCReloadTime; /*!< Prescaler reload mode refer to \ref GPTM_PSC_RLD_Enum              */
} GPTM_TimeBaseInitTypeDef;
/**
 * @brief Definition of GPTM channel output init structure.
 */
typedef struct
{
  GPTM_CH_Enum    Channel;              /*!< Channel selection refer to \ref GPTM_CH_Enum                   */
  GPTM_OM_Enum    OutputMode;           /*!< Channel output mode selection refer to \ref GPTM_OM_Enum       */
  GPTM_CHCTL_Enum Control;              /*!< CHxO output state refer to \ref GPTM_CHCTL_Enum                */
  GPTM_CHP_Enum   Polarity;             /*!< CHxO polarity refer to \ref GPTM_CHP_Enum                      */
  u16             Compare;              /*!< Value for CHxCCR register                                      */
  u16             AsymmetricCompare;    /*!< Value for CHxCCR register                                      */
} GPTM_OutputInitTypeDef;
/**
 * @brief Definition of GPTM channel input init structure.
 */
typedef struct
{
  GPTM_CH_Enum    Channel;         /*!< Channel selection refer to \ref GPTM_CH_Enum                        */
  GPTM_CHP_Enum   Polarity;        /*!< Channel input polarity refer to \ref GPTM_CHP_Enum                  */
  GPTM_CHCCS_Enum Selection;       /*!< Channel capture source selection refer to \ref GPTM_CHCCS_Enum      */
  GPTM_CHPSC_Enum Prescaler;       /*!< Channel Capture prescaler refer to \ref GPTM_CHPSC_Enum             */
  u8              Filter;          /*!< Digital filter Configuration, it must between 0x0 ~ 0xF.            */
} GPTM_CaptureInitTypeDef;
/**
  * @}
  */

