pok3r-custom/pok3r_re_firmware/doc/HT32F1655_56_FWLib_v102_960/library/HT32F1655_56_Driver/inc/ht32f1655_56_gptm.h
/* Exported constants --------------------------------------------------------------------------------------*/
/** @defgroup GPTM_Exported_Constants GPTM exported constants
  * @{
  */

/** @defgroup GPTM_INT Definitions of GPTM_INT
  * @{
  */
#define GPTM_INT_CH0CC        0x0001  /*!< Channel 0 capture/compare interrupt                              */
#define GPTM_INT_CH1CC        0x0002  /*!< Channel 1 capture/compare interrupt                              */
#define GPTM_INT_CH2CC        0x0004  /*!< Channel 2 capture/compare interrupt                              */
#define GPTM_INT_CH3CC        0x0008  /*!< Channel 3 capture/compare interrupt                              */
#define GPTM_INT_UEV          0x0100  /*!< Update interrupt                                                 */
#define GPTM_INT_TEV          0x0400  /*!< Trigger interrupt                                                */
/**
  * @}
  */

/** @defgroup GPTM_PDMA Definitions of GPTM_PDMA
  * @{
  */
#define GPTM_PDMA_CH0CC        0x00010000  /*!< Channel 0 capture/compare PDMA request                      */
#define GPTM_PDMA_CH1CC        0x00020000  /*!< Channel 1 capture/compare PDMA request                      */
#define GPTM_PDMA_CH2CC        0x00040000  /*!< Channel 2 capture/compare PDMA request                      */
#define GPTM_PDMA_CH3CC        0x00080000  /*!< Channel 3 capture/compare PDMA request                      */
#define GPTM_PDMA_UEV          0x01000000  /*!< Update PDMA request                                         */
#define GPTM_PDMA_TEV          0x04000000  /*!< Trigger PDMA request                                        */
/**
  * @}
  */

/** @defgroup GPTM_EVENT Definitions of GPTM_EVENT
  * @{
  */
#define GPTM_EVENT_CH0CC      0x0001  /*!< Channel 0 capture/compare event                                  */
#define GPTM_EVENT_CH1CC      0x0002  /*!< Channel 1 capture/compare event                                  */
#define GPTM_EVENT_CH2CC      0x0004  /*!< Channel 2 capture/compare event                                  */
#define GPTM_EVENT_CH3CC      0x0008  /*!< Channel 3 capture/compare event                                  */
#define GPTM_EVENT_UEV        0x0100  /*!< Update event                                                     */
#define GPTM_EVENT_TEV        0x0400  /*!< Trigger event                                                    */
/**
  * @}
  */

/** @defgroup GPTM_FLAG Definitions of GPTM_FLAG
  * @{
  */
#define GPTM_FLAG_CH0CC       0x0001  /*!< Channel 0 capture/compare flag                                   */
#define GPTM_FLAG_CH1CC       0x0002  /*!< Channel 1 capture/compare flag                                   */
#define GPTM_FLAG_CH2CC       0x0004  /*!< Channel 2 capture/compare flag                                   */
#define GPTM_FLAG_CH3CC       0x0008  /*!< Channel 3 capture/compare flag                                   */
#define GPTM_FLAG_CH0OC       0x0010  /*!< Channel 0 over capture flag                                      */
#define GPTM_FLAG_CH1OC       0x0020  /*!< Channel 1 over capture flag                                      */
#define GPTM_FLAG_CH2OC       0x0040  /*!< Channel 2 over capture flag                                      */
#define GPTM_FLAG_CH3OC       0x0080  /*!< Channel 3 over capture flag                                      */
#define GPTM_FLAG_UEV         0x0100  /*!< Update flag                                                      */
#define GPTM_FLAG_TEV         0x0400  /*!< Trigger flag                                                     */
/**
  * @}
  */

/** @defgroup GPTM_Check_Parameter Check parameter
  * @{
  */

/**
 * @brief Used to check parameter of the GPTMx.
 */
#define IS_GPTM(x) ((x == HT_GPTM0) || (x == HT_GPTM1))
/**
 * @brief Used to check parameter of the output compare mode.
 */
#define IS_GPTM_OM_CMP(x) (((x) == GPTM_OM_MATCH_NOCHANGE) || \
                           ((x) == GPTM_OM_MATCH_INACTIVE) || \
                           ((x) == GPTM_OM_MATCH_ACTIVE) || \
                           ((x) == GPTM_OM_MATCH_TOGGLE) || \
                           ((x) == GPTM_OM_PWM1) || \
                           ((x) == GPTM_OM_PWM2))

/**
 * @brief Used to check parameter of the output mode.
 */
#define IS_GPTM_OM(x) (((x) == GPTM_OM_MATCH_NOCHANGE) || \
                       ((x) == GPTM_OM_MATCH_INACTIVE) || \
                       ((x) == GPTM_OM_MATCH_ACTIVE) || \
                       ((x) == GPTM_OM_MATCH_TOGGLE) || \
                       ((x) == GPTM_OM_PWM1) || \
                       ((x) == GPTM_OM_PWM2) || \
                       ((x) == GPTM_OM_FORCED_INACTIVE) || \
                       ((x) == GPTM_OM_FORCED_ACTIVE) || \
                       ((x) == GPTM_OM_ASYMMETRIC_PWM1) || \
                       ((x) == GPTM_OM_ASYMMETRIC_PWM2))
/**
 * @brief Used to check parameter of the channel.
 */
#define IS_GPTM_CH(x) (((x) == GPTM_CH_0) || ((x) == GPTM_CH_1) || \
                       ((x) == GPTM_CH_2) || ((x) == GPTM_CH_3))
/**
 * @brief Used to check parameter of the channel for PWM input function.
 */
#define IS_GPTM_CH_PWMI(x) (((x) == GPTM_CH_0) || ((x) == GPTM_CH_1))
/**
 * @brief Used to check parameter of the clock divider.
 */
#define IS_GPTM_CKDIV(x)  ((x == GPTM_CKDIV_OFF) || \
                           (x == GPTM_CKDIV_2) || \
                           (x == GPTM_CKDIV_4))
/**
 * @brief Used to check parameter of the counter mode.
 */
#define IS_GPTM_CNT_MODE(x) ((x == GPTM_CNT_MODE_UP) ||  \
                             (x == GPTM_CNT_MODE_CA1) || \
                             (x == GPTM_CNT_MODE_CA2) || \
                             (x == GPTM_CNT_MODE_CA3) || \
                             (x == GPTM_CNT_MODE_DOWN))
/**
 * @brief Used to check parameter of the channel polarity.
 */
#define IS_GPTM_CHP(x)    ((x == GPTM_CHP_NONINVERTED) || (x == GPTM_CHP_INVERTED))
/**
 * @brief Used to check parameter of the channel control.
 */
#define IS_GPTM_CHCTL(x)  ((x == GPTM_CHCTL_DISABLE) || (x == GPTM_CHCTL_ENABLE))
/**
 * @brief Used to check parameter of the channel capture / compare PDMA selection.
 */
#define IS_GPTM_CHCCDS(x) ((x == GPTM_CHCCDS_CHCCEV) || (x == GPTM_CHCCDS_UEV))
/**
 * @brief Used to check parameter of the channel input selection.
 */
#define IS_GPTM_CHCCS(x)  ((x == GPTM_CHCCS_DIRECT) || \
                           (x == GPTM_CHCCS_INDIRECT) || \
                           (x == GPTM_CHCCS_TRCED))
/**
 * @brief Used to check parameter of the channel capture prescaler.
 */
#define IS_GPTM_CHPSC(x)  ((x == GPTM_CHPSC_OFF) || \
                           (x == GPTM_CHPSC_2) || \
                           (x == GPTM_CHPSC_4) || \
                           (x == GPTM_CHPSC_8))
/**
 * @brief Used to check parameter of the ETI prescaler.
 */
#define IS_GPTM_ETIPSC(x) ((x == GPTM_ETIPSC_OFF) || \
                           (x == GPTM_ETIPSC_2) || \
                           (x == GPTM_ETIPSC_4) || \
                           (x == GPTM_ETIPSC_8))
/**
 * @brief Used to check parameter of the GPTM interrupt.
 */
#define IS_GPTM_INT(x) (((x & 0xFFFFFAF0) == 0x0) && (x != 0))
/**
 * @brief Used to check parameter of the GPTM PDMA request.
 */
#define IS_GPTM_PDMA(x) (((x & 0xFAF0FFFF) == 0x0) && (x != 0))
/**
 * @brief Used to check parameter of the GPTM interrupt for \ref GPTM_GetIntStatus function.
 */
#define IS_GPTM_GET_INT(x)  ((x == GPTM_INT_CH0CC) || \
                             (x == GPTM_INT_CH1CC) || \
                             (x == GPTM_INT_CH2CC) || \
                             (x == GPTM_INT_CH3CC) || \
                             (x == GPTM_INT_UEV) || \
                             (x == GPTM_INT_TEV))
/**
 * @brief Used to check parameter of the GPTM STI selection.
 */
#define IS_GPTM_TRSEL(x) ((x == GPTM_TRSEL_UEVG) || \
                           (x == GPTM_TRSEL_TI0S0) || \
                           (x == GPTM_TRSEL_TI1S1) || \
                           (x == GPTM_TRSEL_ETIF) || \
                           (x == GPTM_TRSEL_TI0BED) || \
                           (x == GPTM_TRSEL_ITI0) || \
                           (x == GPTM_TRSEL_ITI1) || \
                           (x == GPTM_TRSEL_ITI2))
/**
 * @brief Used to check parameter of the ITI.
 */
#define IS_GPTM_ITI(x)  ((x == GPTM_TRSEL_ITI0) || (x == GPTM_TRSEL_ITI1) || (x == GPTM_TRSEL_ITI2))
/**
 * @brief Used to check parameter of the GPTM_TRSEL for \ref GPTM_ChExternalClockConfig function.
 */
#define IS_GPTM_TRSEL_CH(x)  ((x == GPTM_TRSEL_TI0S0) || (x == GPTM_TRSEL_TI1S1) || \
                              (x == GPTM_TRSEL_TI0BED))
/**
 * @brief Used to check parameter of the GPTM ETI polarity.
 */
#define IS_GPTM_ETIPOL(x) ((x == GPTM_ETIPOL_NONINVERTED) || (x == GPTM_ETIPOL_INVERTED))
/**
 * @brief Used to check parameter of the GPTM prescaler reload time.
 */
#define IS_GPTM_PSC_RLD(x) ((x == GPTM_PSC_RLD_UPDATE) || (x == GPTM_PSC_RLD_IMMEDIATE))
/**
 * @brief Used to check parameter of the forced action.
 */
#define IS_GPTM_OM_FORCED(x) ((x == GPTM_OM_FORCED_ACTIVE) || (x == GPTM_OM_FORCED_INACTIVE))
/**
 * @brief Used to check parameter of the decoder mode.
 */
#define IS_GPTM_SMSEL_DECODER(x)  ((x == GPTM_SMSEL_DECODER1) || (x == GPTM_SMSEL_DECODER2) || \
                                   (x == GPTM_SMSEL_DECODER3))
/**
 * @brief Used to check parameter of the event.
 */
#define IS_GPTM_EVENT(x)  (((x & 0xFFFFFAF0) == 0x0000) && (x != 0x0000))
/**
 * @brief Used to check parameter of the GPTM master mode selection.
 */
#define IS_GPTM_MMSEL(x)  (((x) == GPTM_MMSEL_RESET) || \
                           ((x) == GPTM_MMSEL_ENABLE) || \
                           ((x) == GPTM_MMSEL_UPDATE) || \
                           ((x) == GPTM_MMSEL_CH0CC) || \
                           ((x) == GPTM_MMSEL_CH0OREF) || \
                           ((x) == GPTM_MMSEL_CH1OREF) || \
                           ((x) == GPTM_MMSEL_CH2OREF) || \
                           ((x) == GPTM_MMSEL_CH3OREF))
/**
 * @brief Used to check parameter of the GPTM slave mode.
 */
#define IS_GPTM_SLAVE_MODE(x) ((x == GPTM_SMSEL_RESTART) || (x == GPTM_SMSEL_PAUSE) || \
                               (x == GPTM_SMSEL_TRIGGER) || (x == GPTM_SMSEL_STIED))
/**
 * @brief Used to check parameter of the GPTM flag.
 */
#define IS_GPTM_FLAG(x) ((x == GPTM_FLAG_CH0CC) || \
                         (x == GPTM_FLAG_CH1CC) || \
                         (x == GPTM_FLAG_CH2CC) || \
                         (x == GPTM_FLAG_CH3CC) || \
                         (x == GPTM_FLAG_CH0OC) || \
                         (x == GPTM_FLAG_CH1OC) || \
                         (x == GPTM_FLAG_CH2OC) || \
                         (x == GPTM_FLAG_CH3OC) || \
                         (x == GPTM_FLAG_UEV) || \
                         (x == GPTM_FLAG_TEV))
/**
 * @brief Used to check parameter of the GPTM flag for \ref GPTM_ClearFlag function.
 */
#define IS_GPTM_FLAG_CLR(x) (((x & 0xFFFFFA00) == 0) && (x != 0))
/**
 * @brief Used to check value of GPTM digital filter.
 */
#define IS_GPTM_FILTER(x) (x <= 0xF)

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------------------------------------*/
/** @defgroup GPTM_Exported_Functions GPTM exported functions
  * @{
  */
void GPTM_DeInit(HT_GPTM_TypeDef* GPTMx);
void GPTM_TimeBaseInit(HT_GPTM_TypeDef* GPTMx, GPTM_TimeBaseInitTypeDef* TimeBaseInit);
void GPTM_OutputInit(HT_GPTM_TypeDef* GPTMx, GPTM_OutputInitTypeDef* OutInit);
void GPTM_CaptureInit(HT_GPTM_TypeDef* GPTMx, GPTM_CaptureInitTypeDef* CapInit);
void GPTM_PwmInputInit(HT_GPTM_TypeDef* GPTMx, GPTM_CaptureInitTypeDef* CapInit);
void GPTM_TimeBaseStructInit(GPTM_TimeBaseInitTypeDef* TimeBaseInit);
void GPTM_OutputStructInit(GPTM_OutputInitTypeDef* OutInit);
void GPTM_CaptureStructInit(GPTM_CaptureInitTypeDef* CapInit);
void GPTM_Cmd(HT_GPTM_TypeDef* GPTMx, ControlStatus NewState);
void GPTM_ItiExternalClockConfig(HT_GPTM_TypeDef* GPTMx, GPTM_TRSEL_Enum Iti);
void GPTM_ChExternalClockConfig(HT_GPTM_TypeDef* GPTMx, GPTM_TRSEL_Enum Sel, GPTM_CHP_Enum Pol, u8 Filter);
void GPTM_EtiExternalClockConfig(HT_GPTM_TypeDef* GPTMx, GPTM_ETIPSC_Enum Psc, GPTM_ETIPOL_Enum Pol, u8 Filter);
void GPTM_EtiConfig(HT_GPTM_TypeDef* GPTMx, GPTM_ETIPSC_Enum Psc, GPTM_ETIPOL_Enum Pol, u8 Filter);
void GPTM_PrescalerConfig(HT_GPTM_TypeDef* GPTMx, u16 Psc, GPTM_PSC_RLD_Enum PscReloadTime);
void GPTM_CounterModeConfig(HT_GPTM_TypeDef* GPTMx, GPTM_CNT_MODE_Enum Mod);
void GPTM_StiConfig(HT_GPTM_TypeDef* GPTMx, GPTM_TRSEL_Enum Sel);
void GPTM_DecoderConfig(HT_GPTM_TypeDef* GPTMx, GPTM_SMSEL_Enum DecoderMod,
                        GPTM_CHP_Enum CH0P, GPTM_CHP_Enum CH1P);
void GPTM_ForcedOREF0(HT_GPTM_TypeDef* GPTMx, GPTM_OM_Enum ForcedAction);
void GPTM_ForcedOREF1(HT_GPTM_TypeDef* GPTMx, GPTM_OM_Enum ForcedAction);
void GPTM_ForcedOREF2(HT_GPTM_TypeDef* GPTMx, GPTM_OM_Enum ForcedAction);
void GPTM_ForcedOREF3(HT_GPTM_TypeDef* GPTMx, GPTM_OM_Enum ForcedAction);
void GPTM_CRRPreloadCmd(HT_GPTM_TypeDef* GPTMx, ControlStatus NewState);
void GPTM_CHCCRPreloadConfig(HT_GPTM_TypeDef* GPTMx, GPTM_CH_Enum Channel, ControlStatus NewState);
void GPTM_ClearOREFConfig(HT_GPTM_TypeDef* GPTMx, GPTM_CH_Enum Channel, ControlStatus NewState);
void GPTM_ChPolarityConfig(HT_GPTM_TypeDef* GPTMx, GPTM_CH_Enum Channel, GPTM_CHP_Enum Pol);

void GPTM_ImmActiveConfig(HT_GPTM_TypeDef* GPTMx, GPTM_CH_Enum Channel, ControlStatus NewState);
void GPTM_ChannelConfig(HT_GPTM_TypeDef* GPTMx, GPTM_CH_Enum Channel, GPTM_CHCTL_Enum Control);

